Lingjia007/stm32f103c8t6_rtt-nano_znjj/Core/Src/main.c
static void adc_sensor_thread_entry(void *parameter)
{
  uint16_t light_raw, mq2_raw;
  uint8_t light_percentage, mq2_percentage;

  rt_thread_mdelay(1000);
  light_sensor_init();
  mq2_init();

  while (1)
  {
    light_raw = light_sensor_read_raw();
    light_percentage = light_sensor_read_percentage();

    mq2_raw = mq2_read_raw();
    mq2_percentage = mq2_read_percentage();

    rt_kprintf("Light: Raw=%d, Pct=%d%% | MQ2: Raw=%d, Pct=%d%%\n",
               light_raw, light_percentage, mq2_raw, mq2_percentage);

    g_kv_light = light_percentage;
    g_kv_mq2 = mq2_percentage;

    if (g_mqtt_connected)
    {
      mqtt_post_item_t item;
      memset(&item, 0, sizeof(item));
      strncpy(item.keys[0], "LIGHT", ONENET_KV_MAX_KEY_LEN - 1);
      strncpy(item.keys[1], "MQ2", ONENET_KV_MAX_KEY_LEN - 1);
      item.key_count = 2;
      mqtt_worker_submit(&g_mqtt_worker, &item);
    }

    rt_thread_mdelay(5000);
  }
}

static void pir_sensor_thread_entry(void *parameter)
{
  uint8_t pir_status;

  rt_thread_mdelay(1500);
  pir_sensor_init();

  while (1)
  {
    pir_status = pir_sensor_read();

    if (pir_status == PIR_DETECTED)
    {
      rt_kprintf("PIR Sensor: Detected! (Someone is here)\n");
      strncpy(g_kv_pir, "detected", sizeof(g_kv_pir) - 1);
    }
    else
    {
      rt_kprintf("PIR Sensor: Not detected (No one)\n");
      strncpy(g_kv_pir, "not_detected", sizeof(g_kv_pir) - 1);
    }

    if (g_mqtt_connected)
    {
      mqtt_post_item_t item;
      memset(&item, 0, sizeof(item));
      strncpy(item.keys[0], "PIR", ONENET_KV_MAX_KEY_LEN - 1);
      item.key_count = 1;
      mqtt_worker_submit(&g_mqtt_worker, &item);
    }

    rt_thread_mdelay(3000);
  }
}

static void mqtt_frame_isr_cb(void *arg)
{
  (void)arg;
  rt_sem_release(g_mqtt_frame_sem);
}

static void mqtt_recv_thread_entry(void *parameter)
{
  static char recv_topic[PLATFORM_MQTT_MAX_TOPIC_LEN];
  static char recv_payload[PLATFORM_MQTT_MAX_PAYLOAD_LEN];
  static char recv_msg_id[32];
  static uint8_t raw_buf[ESP8266_UART_RX_BUF_SIZE];
  uint16_t raw_len = 0;
  uint8_t has_raw = 0;

  rt_thread_mdelay(4000);
  wifi_esp8266_set_frame_cb(g_esp8266_mqtt.wifi, mqtt_frame_isr_cb, NULL);
  rt_kprintf("[mqtt_recv] ISR-driven listening started\n");

  while (1)
  {
    rt_err_t sem_ret = rt_sem_take(g_mqtt_frame_sem, 5000);

    if (sem_ret == -RT_ETIMEOUT)
    {
      if (!g_mqtt_connected)
      {
        rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
        if (mqtt_init() == 0)
          rt_kprintf("[mqtt_recv] Reconnected!\n");
        rt_mutex_release(g_esp8266_mutex);
      }
      continue;
    }

    if (!g_mqtt_connected)
      continue;

    has_raw = 0;

    rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);

    if (g_esp8266_mqtt.wifi->urc.ready)
    {
      raw_len = wifi_esp8266_urc_copy(g_esp8266_mqtt.wifi, raw_buf, sizeof(raw_buf));
      wifi_esp8266_rx_restart(g_esp8266_mqtt.wifi);
      rt_mutex_release(g_esp8266_mutex);
      if (raw_len > 0)
        has_raw = 1;
    }
    else if (g_esp8266_mqtt.wifi->rx_frame.sta.finsh == 1)
    {
      uint16_t flen = g_esp8266_mqtt.wifi->rx_frame.sta.len;
      if (flen > sizeof(raw_buf) - 1)
        flen = sizeof(raw_buf) - 1;
      memcpy(raw_buf, g_esp8266_mqtt.wifi->rx_frame.buf, flen);
      raw_buf[flen] = '\0';
      raw_len = flen;
      wifi_esp8266_rx_restart(g_esp8266_mqtt.wifi);
      rt_mutex_release(g_esp8266_mutex);
      has_raw = 1;
    }
    else
    {
      rt_mutex_release(g_esp8266_mutex);
      continue;
    }

    if (!has_raw)
      continue;

    if (strstr((const char *)raw_buf, "+MQTTSUBRECV:") == NULL)
      continue;

    memset(recv_topic, 0, sizeof(recv_topic));
    memset(recv_payload, 0, sizeof(recv_payload));
    memset(recv_msg_id, 0, sizeof(recv_msg_id));

    int16_t recv_ret = esp8266_mqtt_parse_set_from_buf(
        (const char *)raw_buf, raw_len,
        recv_topic, recv_payload,
        sizeof(recv_payload), recv_msg_id);

    if (recv_ret != PLATFORM_MQTT_OK)
      continue;

    if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_SET) == 0)
    {
      rt_kprintf("[mqtt_recv] SET: %s\n", recv_payload);

      int reply_code;
      const char *reply_msg;
      onenet_cmd_handle_set(&g_cmd_ctx, recv_payload, &reply_code, &reply_msg);

      rt_mutex_take(g_esp8266_mutex, RT_WAITING_FOREVER);
      int16_t reply_ret = MQTT_PUBLISH_SET_REPLY(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                                                 ONENET_PRODUCT_ID, ONENET_DEVICE_NAME,
                                                 recv_msg_id, reply_code, reply_msg);
      rt_mutex_release(g_esp8266_mutex);

      if (reply_ret == PLATFORM_MQTT_OK)
        rt_kprintf("[mqtt_recv] SET_REPLY sent (code=%d)\n", reply_code);
      else
        rt_kprintf("[mqtt_recv] SET_REPLY FAIL (err=%d)\n", reply_ret);
    }
    else
    {
      if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_POST_REPLY) == 0)
        continue;

      rt_kprintf("[mqtt_recv] topic=%s\n", recv_topic);
      rt_kprintf("[mqtt_recv] payload=%s\n", recv_payload);

      if (strcmp(recv_topic, ONENET_TOPIC_PROPERTY_GET) == 0)
      {
        onenet_cmd_handle_get(&g_cmd_ctx, recv_payload, recv_msg_id);
      }
      else if (strcmp(recv_topic, ONENET_TOPIC_OTA_INFORM) == 0)
      {
        rt_kprintf("[mqtt_recv] OTA inform\n");
      }
    }
  }
}

static int mqtt_do_connect(void)
{
  int16_t ret;

  if (!g_mqtt_configured)
  {
    platform_mqtt_user_config_t config;

    memset(&config, 0, sizeof(config));
    strncpy(config.client_id, ONENET_DEVICE_NAME, sizeof(config.client_id) - 1);
    strncpy(config.username, ONENET_PRODUCT_ID, sizeof(config.username) - 1);
    strncpy(config.password, ONENET_MQTT_TOKEN, sizeof(config.password) - 1);

    ret = MQTT_USERCFG(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID, &config);
    if (ret != PLATFORM_MQTT_OK)
    {
      rt_kprintf("MQTT config FAILED! (error=%d)\n", ret);
      return -1;
    }
    g_mqtt_configured = 1;
    rt_kprintf("MQTT configured!\n");
  }
  else
  {
    rt_kprintf("MQTT already configured, reconnecting...\n");
  }

  ret = MQTT_CONNECT(&g_esp8266_mqtt.base, ESP8266_MQTT_LINK_ID,
                     ONENET_MQTT_HOST, ONENET_MQTT_PORT, 1);
  if (ret != PLATFORM_MQTT_OK)
  {
    rt_kprintf("MQTT connect FAILED! resetting config flag\n");
    g_mqtt_configured = 0;
    g_mqtt_connected = 0;
    return -1;
  }

  g_mqtt_connected = 1;
  rt_kprintf("MQTT connected!\n");
  return 0;
}

